In [ ]:
# A Dataframe is a two dimensional data structure . i.e data in a tabular format row and columns
#1. Size is mutable
#2. Labeled axes(rows and columns)
#3. Can perform multiple opration arithmentic ..etc

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame()

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
dt={
"Name":['Jhon',"Saim","Devid","Allen","Bob"],
"Age":[43,33,22,33,44],
"Address":["abc","pqr","xyz","wer","asd"],
"Sal":[56000,45000,34000,23000,78000]  
}

In [5]:
df=pd.DataFrame(dt)

In [6]:
len(df)

5

In [7]:
import pandas as pd
data=[['Raj',10],['sam',12],['yash',13],['bob',14]]
emp=pd.DataFrame(data,columns=['Name','Age'])

In [8]:
emp

   Name  Age
0   Raj   10
1   sam   12
2  yash   13
3   bob   14

In [22]:
#Create a DataFrame from dict with custom index

In [9]:
dt={
"Name":['Jhon',"Saim","Devid","Allen","Bob"],
"Age":[43,33,22,33,44],
"Address":["abc","pqr","xyz","wer","asd"],
"Sal":[56000,45000,34000,23000,78000]  
}
df=pd.DataFrame(dt,index=["A","B","C","D","E"])

In [10]:
df

    Name  Age Address    Sal
A   Jhon   43     abc  56000
B   Saim   33     pqr  45000
C  Devid   22     xyz  34000
D  Allen   33     wer  23000
E    Bob   44     asd  78000

In [11]:
# creating dataframe from list of dict

In [12]:
data=[{'name':'raj','age':20},{'name':'sam','age':22,'contact':23456676}]

In [13]:
df=pd.DataFrame(data)
df

  name  age     contact
0  raj   20         NaN
1  sam   22  23456676.0

In [27]:
#Creating dataframe from dict of series

In [14]:
data={'one':pd.Series([1,2,3],index=['a','b','c']),
      'two':pd.Series([1,2,3,4],index=['a','b','c','d'])
     
     }

In [15]:
df=pd.DataFrame(data)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [18]:
dt={
"Name":['Jhon',"Saim","Devid","Allen","Bob"],
"Age":[43,33,22,33,44],
"Address":["abc","pqr","xyz","wer","asd"],
"Sal":[56000,45000,34000,23000,78000]  
}
df=pd.DataFrame(dt,index=["A","B","C","D","E"])

In [19]:
df

    Name  Age Address    Sal
A   Jhon   43     abc  56000
B   Saim   33     pqr  45000
C  Devid   22     xyz  34000
D  Allen   33     wer  23000
E    Bob   44     asd  78000

In [ ]:
# Q1. Add 1000 to salary
# Q2. Display only Name and Salary
# Q3. Display only age and address with Name
# Q4. sub age by 2 
# Q5. Display all the columns

In [20]:
df['Sal']+=1000

In [21]:
df[['Name','Sal']]

    Name    Sal
A   Jhon  57000
B   Saim  46000
C  Devid  35000
D  Allen  24000
E    Bob  79000

In [53]:
df[['Name','Age','Address']]

    Name  Age Address
A   Jhon   43     abc
B   Saim   33     pqr
C  Devid   22     xyz
D  Allen   33     wer
E    Bob   44     asd

In [54]:
df['Age']-=2

In [60]:
list(df.columns)

['Name', 'Age', 'Address', 'Sal']

In [61]:
# DataFrame and basic funcationality

In [64]:
df.dtypes

Name       object
Age         int64
Address    object
Sal         int64
dtype: object

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Address  5 non-null      object
 3   Sal      5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 372.0+ bytes

In [66]:
df.describe

<bound method NDFrame.describe of     Name  Age Address    Sal
A   Jhon   41     abc  57000
B   Saim   31     pqr  46000
C  Devid   20     xyz  35000
D  Allen   31     wer  24000
E    Bob   42     asd  79000>

In [67]:
df.describe()

             Age           Sal
count   5.000000      5.000000
mean   33.000000  48200.000000
std     8.972179  21158.922468
min    20.000000  24000.000000
25%    31.000000  35000.000000
50%    31.000000  46000.000000
75%    41.000000  57000.000000
max    42.000000  79000.000000

In [68]:
df.describe(include=['object','int64'])

        Name        Age Address           Sal
count      5   5.000000       5      5.000000
unique     5        NaN       5           NaN
top     Jhon        NaN     abc           NaN
freq       1        NaN       1           NaN
mean     NaN  33.000000     NaN  48200.000000
std      NaN   8.972179     NaN  21158.922468
min      NaN  20.000000     NaN  24000.000000
25%      NaN  31.000000     NaN  35000.000000
50%      NaN  31.000000     NaN  46000.000000
75%      NaN  41.000000     NaN  57000.000000
max      NaN  42.000000     NaN  79000.000000

In [71]:
df.head(3)

    Name  Age Address    Sal
A   Jhon   41     abc  57000
B   Saim   31     pqr  46000
C  Devid   20     xyz  35000

In [73]:
df.tail(2)

    Name  Age Address    Sal
D  Allen   31     wer  24000
E    Bob   42     asd  79000

In [74]:
df.size

20

In [75]:
df.shape

(5, 4)

In [77]:
df.min()

Name       Allen
Age           20
Address      abc
Sal        24000
dtype: object

In [78]:
df.max()

Name        Saim
Age           42
Address      xyz
Sal        79000
dtype: object

In [81]:
df.axes

[Index(['A', 'B', 'C', 'D', 'E'], dtype='object'),
 Index(['Name', 'Age', 'Address', 'Sal'], dtype='object')]

In [85]:
df.values

array([['Jhon', 41, 'abc', 57000],
       ['Saim', 31, 'pqr', 46000],
       ['Devid', 20, 'xyz', 35000],
       ['Allen', 31, 'wer', 24000],
       ['Bob', 42, 'asd', 79000]], dtype=object)

In [86]:
df.count()

Name       5
Age        5
Address    5
Sal        5
dtype: int64

In [87]:
df.std()

C:\Users\Premchandra Upadhyay\AppData\Local\Temp\ipykernel_15972\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age        8.972179
Sal    21158.922468
dtype: float64

In [89]:
df.mean()

C:\Users\Premchandra Upadhyay\AppData\Local\Temp\ipykernel_15972\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       33.0
Sal    48200.0
dtype: float64

In [90]:
df.ndim

2

In [92]:
df.mode

<bound method DataFrame.mode of     Name  Age Address    Sal
A   Jhon   41     abc  57000
B   Saim   31     pqr  46000
C  Devid   20     xyz  35000
D  Allen   31     wer  24000
E    Bob   42     asd  79000>

In [94]:
df.median

<bound method NDFrame._add_numeric_operations.<locals>.median of     Name  Age Address    Sal
A   Jhon   41     abc  57000
B   Saim   31     pqr  46000
C  Devid   20     xyz  35000
D  Allen   31     wer  24000
E    Bob   42     asd  79000>

In [95]:
df.dtypes

Name       object
Age         int64
Address    object
Sal         int64
dtype: object

In [98]:
df['Sal'].dtypes.name

'int64'